cylinder-flap-3d/OpenFOAM-deal.II/Fluid/0.orig/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    cylinder
    {
        type            noSlip;
    }    

    flap
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    top
    {
        type            noSlip;
    }

    bottom
    {
        type            noSlip;
    }

    inlet
    {
        // Time-varying inlet velocity
        type            uniformFixedValue;
        uniformValue    table 
                        ( 
                            ( 0 ( 0 0 0 ) ) 
                            ( 2. ( 2. 0 0 ) ) 
                            ( 100 ( 2. 0 0 ) ) 
                        );
    }

    outlet
    {
        type            zeroGradient;
    }

    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}

// ************************************************************************* //
